app/Http/Controllers/UsersController.php

select * from `users` where `users`.`id` = '9' limit 1
select `projects`.*, `projects_users`.`user_id` as `pivot_user_id`, `projects_users`.`project_id` as `pivot_project_id` from `projects` inner join `projects_users` on `projects`.`id` = `projects_users`.`project_id` where `projects_users`.`user_id` in (9)
---
    public function getProjects($userId)
    {
        $projects = User::with('projects')->findOrFail($userId)->Projects;

insert into `project_user` (`project_id`, `user_id`) values (21, 9)
---
    public function postRegisterWithProject(Request $request)
    {
        $data = $request->all();
        $validator = Validator::make($data, [
            'email' => 'required|email|unique:users,email|max:200',
            'firstname' => 'required|min:1|max:50',
            'lastname' => 'required|min:1|max:50',
            'password' => 'required|min:8|max:50',
            'project_name' => 'required|string|min:1|max:50'
        ]);

        if ($validator->fails()) {
            return response()->json(['messages' => $validator->messages()], 400);
        }

        DB::beginTransaction();
        try {
            $newUserData = $request->only('email', 'firstname', 'lastname');
            $newUserData['password'] = Hash::make($request->get('password'));
            $newUser = User::create($newUserData);
            $newProject = Project::create(['name' => $data['project_name']]);
            $newProject->users()->attach($newUser->id);